{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      ".": 5,
      "a": 6,
      "b": 7,
      "c": 8,
      "d": 9,
      "e": 10,
      "f": 11,
      "g": 12,
      "h": 13,
      "i": 14,
      "j": 15,
      "k": 16,
      "l": 17,
      "m": 18,
      "n": 19,
      "o": 20,
      "p": 21,
      "q": 22,
      "r": 23,
      "s": 24,
      "t": 25,
      "u": 26,
      "v": 27,
      "w": 28,
      "x": 29,
      "y": 30,
      "z": 31,
      "##o": 32,
      "##u": 33,
      "##d": 34,
      "##l": 35,
      "##y": 36,
      "##k": 37,
      "##e": 38,
      "##n": 39,
      "##i": 40,
      "##z": 41,
      "##g": 42,
      "##a": 43,
      "##t": 44,
      "##v": 45,
      "##r": 46,
      "##q": 47,
      "##c": 48,
      "##s": 49,
      "##w": 50,
      "##x": 51,
      "##m": 52,
      "##p": 53,
      "##h": 54,
      "##f": 55,
      "##he": 56,
      "the": 57,
      "##at": 58,
      "to": 59,
      "##en": 60,
      "##an": 61,
      "##mp": 62,
      "is": 63,
      "imp": 64,
      "##or": 65,
      "##oc": 66,
      "##ken": 67,
      "##es": 68,
      "##iz": 69,
      "##tan": 70,
      "token": 71,
      "impor": 72,
      "##tant": 73,
      "tokeniz": 74,
      "important": 75,
      "an": 76,
      "in": 77,
      "pr": 78,
      "##on": 79,
      "##in": 80,
      "##ion": 81,
      "##ation": 82,
      "##oces": 83,
      "tokenization": 84,
      "proces": 85,
      "process": 86,
      "do": 87,
      "of": 88,
      "si": 89,
      "st": 90,
      "##ow": 91,
      "##ep": 92,
      "##ge": 93,
      "##her": 94,
      "##ing": 95,
      "dog": 96,
      "step": 97,
      "bi": 98,
      "ba": 99,
      "br": 100,
      "cat": 101,
      "fo": 102,
      "fl": 103,
      "fe": 104,
      "ju": 105,
      "lo": 106,
      "la": 107,
      "lan": 108,
      "nl": 109,
      "ni": 110,
      "nat": 111,
      "on": 112,
      "ov": 113,
      "qu": 114,
      "se": 115,
      "te": 116,
      "win": 117,
      "##ud": 118,
      "##ua": 119,
      "##ur": 120,
      "##uen": 121,
      "##ds": 122,
      "##dow": 123,
      "##ll": 124,
      "##ly": 125,
      "##ks": 126,
      "##er": 127,
      "##ic": 128,
      "##zy": 129,
      "##gh": 130,
      "##gua": 131,
      "##al": 132,
      "##ts": 133,
      "##ther": 134,
      "##rds": 135,
      "##rks": 136,
      "##quen": 137,
      "##ces": 138,
      "##xt": 139,
      "##ather": 140,
      "toge": 141,
      "##mps": 142,
      "##ock": 143,
      "tokenizing": 144,
      "processing": 145,
      "sill": 146,
      "sits": 147,
      "##own": 148,
      "birds": 149,
      "barks": 150,
      "brown": 151,
      "fox": 152,
      "flock": 153,
      "feather": 154,
      "jumps": 155,
      "loud": 156,
      "lazy": 157,
      "langua": 158,
      "nlp": 159,
      "nigh": 160,
      "natur": 161,
      "over": 162,
      "quic": 163,
      "sequen": 164,
      "text": 165,
      "window": 166,
      "together": 167,
      "loudly": 168,
      "language": 169,
      "night": 170,
      "natural": 171,
      "quick": 172,
      "sequences": 173
    }
  }
}